bikeNomad/6800_Emulator/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTA5 (number 97), NRESET
  @{ */
#define BOARD_INITPINS_NRESET_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_NRESET_PIN 5U     /*!<@brief PORTA pin index: 5 */
                                         /* @} */

/*! @name PORTD0 (number 4), MCU_A0
  @{ */
#define BOARD_INITPINS_MCU_A0_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A0_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A0_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                         /* @} */

/*! @name PORTD1 (number 3), MCU_A1
  @{ */
#define BOARD_INITPINS_MCU_A1_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A1_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                         /* @} */

/*! @name PORTD2 (number 71), MCU_A2
  @{ */
#define BOARD_INITPINS_MCU_A2_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A2_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                         /* @} */

/*! @name PORTD3 (number 70), MCU_A3
  @{ */
#define BOARD_INITPINS_MCU_A3_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A3_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                         /* @} */

/*! @name PORTD4 (number 69), MCU_A4
  @{ */
#define BOARD_INITPINS_MCU_A4_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A4_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A4_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                         /* @} */

/*! @name PORTD5 (number 33), MCU_A5
  @{ */
#define BOARD_INITPINS_MCU_A5_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A5_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A5_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                         /* @} */

/*! @name PORTD6 (number 32), MCU_A6
  @{ */
#define BOARD_INITPINS_MCU_A6_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A6_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A6_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                         /* @} */

/*! @name PORTD7 (number 31), MCU_A7
  @{ */
#define BOARD_INITPINS_MCU_A7_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A7_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A7_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                         /* @} */

/*! @name PORTD8 (number 42), MCU_A8
  @{ */
#define BOARD_INITPINS_MCU_A8_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A8_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A8_PIN 8U     /*!<@brief PORTD pin index: 8 */
                                         /* @} */

/*! @name PORTD9 (number 41), MCU_A9
  @{ */
#define BOARD_INITPINS_MCU_A9_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A9_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A9_PIN 9U     /*!<@brief PORTD pin index: 9 */
                                         /* @} */

/*! @name PORTD10 (number 36), MCU_A10
  @{ */
#define BOARD_INITPINS_MCU_A10_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A10_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A10_PIN 10U    /*!<@brief PORTD pin index: 10 */
                                          /* @} */

/*! @name PORTD11 (number 35), MCU_A11
  @{ */
#define BOARD_INITPINS_MCU_A11_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A11_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A11_PIN 11U    /*!<@brief PORTD pin index: 11 */
                                          /* @} */

/*! @name PORTD12 (number 34), MCU_A12
  @{ */
#define BOARD_INITPINS_MCU_A12_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A12_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A12_PIN 12U    /*!<@brief PORTD pin index: 12 */
                                          /* @} */

/*! @name PORTD13 (number 25), MCU_A13
  @{ */
#define BOARD_INITPINS_MCU_A13_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A13_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A13_PIN 13U    /*!<@brief PORTD pin index: 13 */
                                          /* @} */

/*! @name PORTD14 (number 24), MCU_A14
  @{ */
#define BOARD_INITPINS_MCU_A14_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A14_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A14_PIN 14U    /*!<@brief PORTD pin index: 14 */
                                          /* @} */

