bikeNomad/6800_Emulator/board/pin_mux.h
/*! @name PORTD15 (number 22), MCU_A15
  @{ */
#define BOARD_INITPINS_MCU_A15_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_A15_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_A15_PIN 15U    /*!<@brief PORTD pin index: 15 */
                                          /* @} */

/*! @name PORTD16 (number 21), MCU_VMA
  @{ */
#define BOARD_INITPINS_MCU_VMA_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_VMA_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_VMA_PIN 16U    /*!<@brief PORTD pin index: 16 */
                                          /* @} */

/*! @name PORTD17 (number 20), MCU_RW
  @{ */
#define BOARD_INITPINS_MCU_RW_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_MCU_RW_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_MCU_RW_PIN 17U    /*!<@brief PORTD pin index: 17 */
                                         /* @} */

/*! @name PORTA2 (number 73), UART0_RX
  @{ */
#define BOARD_INITPINS_UART0_RX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_UART0_RX_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                           /* @} */

/*! @name PORTA3 (number 72), UART0_TX
  @{ */
#define BOARD_INITPINS_UART0_TX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_UART0_TX_PIN 3U     /*!<@brief PORTA pin index: 3 */
                                           /* @} */

/*! @name PORTA12 (number 90), CAN1_RX
  @{ */
#define BOARD_INITPINS_CAN1_RX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_CAN1_RX_PIN 12U    /*!<@brief PORTA pin index: 12 */
                                          /* @} */

/*! @name PORTA13 (number 89), CAN1_TX
  @{ */
#define BOARD_INITPINS_CAN1_TX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_CAN1_TX_PIN 13U    /*!<@brief PORTA pin index: 13 */
                                          /* @} */

/*! @name PORTC6 (number 81), UART1_RX
  @{ */
#define BOARD_INITPINS_UART1_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_UART1_RX_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                           /* @} */

/*! @name PORTC7 (number 80), UART1_TX
  @{ */
#define BOARD_INITPINS_UART1_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_UART1_TX_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                           /* @} */

/*! @name PORTA1 (number 78), UART0_RTS
  @{ */
#define BOARD_INITPINS_UART0_RTS_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_UART0_RTS_PIN 1U     /*!<@brief PORTA pin index: 1 */
                                            /* @} */

/*! @name PORTA7 (number 57), UART1_RTS
  @{ */
#define BOARD_INITPINS_UART1_RTS_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_UART1_RTS_PIN 7U     /*!<@brief PORTA pin index: 7 */
                                            /* @} */

/*! @name PORTE9 (number 23), DAC_OUT
  @{ */
#define BOARD_INITPINS_DAC_OUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_DAC_OUT_PIN 9U     /*!<@brief PORTE pin index: 9 */
                                          /* @} */

/*! @name PORTE4 (number 9), CAN0_RX
  @{ */
#define BOARD_INITPINS_CAN0_RX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_CAN0_RX_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                          /* @} */

/*! @name PORTE5 (number 8), CAN0_TX
  @{ */
#define BOARD_INITPINS_CAN0_TX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_CAN0_TX_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                          /* @} */

/*! @name PORTB0 (number 54), MCU_D0
  @{ */
#define BOARD_INITPINS_MCU_D0_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D0_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D0_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                         /* @} */

/*! @name PORTB1 (number 53), MCU_D1
  @{ */
#define BOARD_INITPINS_MCU_D1_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D1_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D1_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                         /* @} */

/*! @name PORTB2 (number 48), MCU_D2
  @{ */
#define BOARD_INITPINS_MCU_D2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D2_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                         /* @} */

/*! @name PORTB3 (number 47), MCU_D3
  @{ */
#define BOARD_INITPINS_MCU_D3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D3_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D3_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                         /* @} */

/*! @name PORTB4 (number 28), MCU_D4
  @{ */
#define BOARD_INITPINS_MCU_D4_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D4_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D4_PIN 4U     /*!<@brief PORTB pin index: 4 */
                                         /* @} */

/*! @name PORTB5 (number 27), MCU_D5
  @{ */
#define BOARD_INITPINS_MCU_D5_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D5_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D5_PIN 5U     /*!<@brief PORTB pin index: 5 */
                                         /* @} */

/*! @name PORTB6 (number 16), MCU_D6
  @{ */
#define BOARD_INITPINS_MCU_D6_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D6_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D6_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                         /* @} */

