bikeNomad/6800_Emulator/board/pin_mux.h
/*! @name PORTB7 (number 15), MCU_D7
  @{ */
#define BOARD_INITPINS_MCU_D7_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_MCU_D7_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_MCU_D7_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                         /* @} */

/*! @name PORTA0 (number 79), MCU_NMI
  @{ */
#define BOARD_INITPINS_MCU_NMI_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_MCU_NMI_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MCU_NMI_PIN 0U     /*!<@brief PORTA pin index: 0 */
                                          /* @} */

/*! @name PORTA6 (number 58), MCU_IRQ
  @{ */
#define BOARD_INITPINS_MCU_IRQ_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_MCU_IRQ_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MCU_IRQ_PIN 6U     /*!<@brief PORTA pin index: 6 */
                                          /* @} */

/*! @name PORTA9 (number 99), MCU_RESET
  @{ */
#define BOARD_INITPINS_MCU_RESET_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_MCU_RESET_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MCU_RESET_PIN 9U     /*!<@brief PORTA pin index: 9 */
                                            /* @} */

/*! @name PORTB14 (number 66), LED_1
  @{ */
#define BOARD_INITPINS_LED_1_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_1_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_1_PIN 14U    /*!<@brief PORTB pin index: 14 */
                                        /* @} */

/*! @name PORTB15 (number 65), LED_2
  @{ */
#define BOARD_INITPINS_LED_2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_2_PIN 15U    /*!<@brief PORTB pin index: 15 */
                                        /* @} */

/*! @name PORTB17 (number 63), LED_4
  @{ */
#define BOARD_INITPINS_LED_4_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_4_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_4_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                        /* @} */

/*! @name PORTB16 (number 64), LED_3
  @{ */
#define BOARD_INITPINS_LED_3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_3_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_3_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                        /* @} */

/*! @name PORTC1 (number 39), EX_4
  @{ */
#define BOARD_INITPINS_EX_4_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EX_4_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_4_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                       /* @} */

/*! @name PORTC2 (number 30), EX_3
  @{ */
#define BOARD_INITPINS_EX_3_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EX_3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_3_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                       /* @} */

/*! @name PORTC3 (number 29), EX_2
  @{ */
#define BOARD_INITPINS_EX_2_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EX_2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_2_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                       /* @} */

/*! @name PORTC15 (number 45), EX_8
  @{ */
#define BOARD_INITPINS_EX_8_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EX_8_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_8_PIN 15U    /*!<@brief PORTC pin index: 15 */
                                       /* @} */

/*! @name PORTC16 (number 44), EX_7
  @{ */
#define BOARD_INITPINS_EX_7_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EX_7_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_7_PIN 16U    /*!<@brief PORTC pin index: 16 */
                                       /* @} */

/*! @name PORTC17 (number 43), EX_6
  @{ */
#define BOARD_INITPINS_EX_6_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EX_6_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_6_PIN 17U    /*!<@brief PORTC pin index: 17 */
                                       /* @} */

/*! @name PORTE8 (number 26), EX_1
  @{ */
#define BOARD_INITPINS_EX_1_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_EX_1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_EX_1_PIN 8U     /*!<@brief PORTE pin index: 8 */
                                       /* @} */

/*! @name PORTA8 (number 100), MCU_E
  @{ */
#define BOARD_INITPINS_MCU_E_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_MCU_E_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_MCU_E_PIN 8U     /*!<@brief PORTA pin index: 8 */
                                        /* @} */

/*! @name PORTC0 (number 40), EX_5_E_CLK_OUT
  @{ */
#define BOARD_INITPINS_EX_5_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_EX_5_PIN 0U     /*!<@brief PORTC pin index: 0 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
